org/web-ar-s101.org
# -*- mode: org; coding: utf-8; -*-
#+title: Web AR 101
#+author: Junahan
#+email:  junahan@outlook.com
#+date:  2018-08-12
#+hugo_base_dir: ../
#+hugo_auto_set_lastmod: t
#+hugo_tags: WebAR
#+hugo_categories: AR
#+keywords: web ar
#+hugo_draft: false
#+language:  cn
#+options:  H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+options:  TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+infojs_opt:  view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+license:  CC BY 4.0

* 摘要

通过 Web 浏览器实现 VR/AR (虚拟显示/增强现实) 具有如此强大的吸引力，Web 标准组织 W3C 和工业界（如 Google）分别在标准和框架实践两个方面推动项技术的发展。相关标准和 AR 框架的介绍，请参阅由 [[https://geekplux.com/2018/01/18/augmented-reality-development-tech-in-web-frontend.html][GeekPlux]] 撰写的文章 - [[https://geekplux.com/2018/01/18/augmented-reality-development-tech-in-web-frontend.html][Web 前端中的增强现实 (AR) 开发技术]]。

* 技术框架

** WebARonARKit 和 WebARonARCore

- [[https://github.com/google-ar/WebARonARKit][WebARonARKit]] - 是一个实验性的 iOS 应用，用于开发者使用 web 技术创建 AR 应用实验。
- [[https://github.com/google-ar/WebARonARCore][WebARonARCore]] - 是一个实验性的 Android 应用, 用于开发者使用 web 技术创建 AR 应用实验。

** Three.ar.js

[[https://github.com/google-ar/three.ar.js][Thee.ar.js]] 是一个 [[https://threejs.org/][three.js]] 库的辅助类库，其运行于 [[https://github.com/google-ar/WebARonARKit][WebARonARKit]] 和 [[https://github.com/google-ar/WebARonARCore][WebARonARCore]]，用于构建 Web AR 应用。

** AR.js

[[https://jeromeetienne.github.io/AR.js/][AR.js]] 是一个 Web AR 框架，作者 [[https://twitter.com/jerome_etienne][Jerome Etienne]]。该框架特点：

- 快速：可以高效的运行在智能手机上 (60 fps) ；
- 基于 Web：完全基于 Web，无需安装。 纯 javascrip 实现，基于 three.js + jsartoolkit5；
- 开源：完全开源且免费；
- 标准：工作于任何支持 [[http://caniuse.com/#feat=webgl][webgl]] 和 [[http://caniuse.com/#feat=stream][webrtc]] 的智能手机；

* 推荐阅读
1. [[https://geekplux.com/2018/01/18/augmented-reality-development-tech-in-web-frontend.html][Web 前端中的增强现实 (AR) 开发技术]] by [[https://geekplux.com/2018/01/18/augmented-reality-development-tech-in-web-frontend.html][GeekpPlux]] - 该文详细的介绍了 Web AR 相关标准 (W3C [[https://www.w3.org/community/webvr/][WebVR  Group]]) 和两个重要框架 ([[https://github.com/google-ar/three.ar.js][three.ar.js]] 和 [[https://github.com/jeromeetienne/AR.js][ar.js]]) 的进展。
2. [[https://medium.com/arjs/webvr-for-augmented-reality-f1e69a505902][WebAR for Augmented Reality]] by [[https://medium.com/@jerome_etienne][Jerome Etienne]] - 该文介绍了为什么 WebVR 相关标准和技术也适用于 WebAR 并倡导融合标准和框架。
3. [[http://tgideas.qq.com/webplat/info/news_version3/804/7104/7106/m5723/201612/537832.shtml][Web 前端也能做的 AR 互动]] by [[http://tgideas.qq.com/webplat/info/news_version3/804/7104/7106/m5723/201612/537832.shtml][Tgideas]] - 该文结合一个实际的项目介绍了在浏览器上实现 AR 互动的经验和遇到的问题。

* 参考文献
1. WebVR，https://webvr.info/.
3. W3 WebVR 工作组, https://www.w3.org/community/immersive-web/.
5. Web 前端中的增强现实（AR）开发技术，https://geekplux.com/2018/01/18/augmented-reality-development-tech-in-web-frontend.html.
7. WebVR for Argmented Reality, https://medium.com/arjs/webvr-for-augmented-reality-f1e69a505902.
9. WebVR API extendsion for smartphone AR, https://github.com/google-ar/three.ar.js/blob/master/webvr_ar_extension.md.
11. AR.js - Augmented Reality for the Web, https://jeromeetienne.github.io/AR.js/.
13. WebRTC, https://webrtc.org.
15. Web 前端也能做的 AR 互动, http://tgideas.qq.com/webplat/info/news_version3/804/7104/7106/m5723/201612/537832.shtml.
17. WebARonARKit, https://github.com/google-ar/WebARonARKit.
19. WebARonARCore, https://github.com/google-ar/WebARonARCore.

